W7/D2/MusicApp/app/controllers/users_controller.rb

  def create #post new user
    @user = User.new(user_params) #create user instance with params
    if @user.save #try to save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"