W7/D5/RedditClone/app/controllers/users_controller.rb

  def show
    # @user = User.find_by(username: params[:username]) # may want to use find(:id)
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "Mattasdf"], ["password_digest", "$2a$12$RY5ivC1dcqkE4gSSwvfzleJVP.YwnyzKZCY/Xx3zCJEd2u0Q1AeLe"], ["updated_at", "2021-10-15 23:30:13.576814"], ["id", 1]]