W7/D2/MusicApp/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token #call class method to gen rand string
    self.save! #save with ! to throw error messages if applicable
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Hyoq6-W1r5UIpghk7tHITg"], ["updated_at", "2021-10-12 23:12:13.421318"], ["id", 1]]