W7/D3/GoalsApp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @users = User.all