Week 6/D3/FirstRoutes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "David"], ["email", "dchan@gmaill.com"], ["created_at", "2021-10-07 00:15:18.914023"], ["updated_at", "2021-10-07 00:15:18.914023"]]
---
  def create
    p params
    user = User.new(params.require(:user).permit(:name, :email))
    # replace the `user_attributes_here` with the actual attribute keys
    user.save!